def day2_1():
    two_digit_namber = input("напишіть число")  # получаю число
    print(two_digit_namber[0] + "+" + two_digit_namber[1])  # пишу дію яку виконую
    print(int(two_digit_namber[0]) + int(two_digit_namber[1]))  # перетворюю тип даних і пишу відповідь


def day2_2():
    weight = input("скільки ти важиш? ")  # получаю вагу
    height = input("який в тебе ріст? ")  # получаю ріст
    print(f"твій індекс маси тіла {int(float(weight) / float(height) ** 2)}")  # вираховую і вивожу індекс маси тіла

def day2_3():
    age = input("скільки вам років? ") #дізнаюсь вік людини
    years = 90 #записую до якого віку протрібно рахувати кількусть днів, тижнів, місяців
    days = 365
    weeks = 52
    months = 12
    years_left = years - int(age) #вираховую суільки років лишилось до цього віку
    print(f"у вас залишилося {days * years_left} днів, {weeks * years_left} тижнів, {months * years_left} місяців, {years_left} років, до 90 років") #вираховую і пишу кількість днів...

def day2():
    print("ласкаво просимо до калькулятора чайових")
    bill = float(input("яка загальна вартість? ")) #получаю загальну суму
    tip = int(input("скільки процентів чацьових ви хочете дати? ")) #получаю процент чайових
    how_many_peoples = int(input("на скільки людей розділити рахунок? ")) #получаю кількість людей
    pay = "{:.2f}".format((tip / 100 + 1) * bill / how_many_peoples) #вираховую скільки треба кожному заплатити і округлюю до 2 чисел після коми
    print(f"вам треба заплатити по: {pay}") #вивожу по скільки треба заплатити


day2()