import random

logo = ''' _                                             
| |                                            
| |__   __ _ _ __   __ _ _ __ ___   __ _ _ __  
| '_ \ / _` | '_ \ / _` | '_ ` _ \ / _` | '_ \ 
| | | | (_| | | | | (_| | | | | | | (_| | | | |
|_| |_|\__,_|_| |_|\__, |_| |_| |_|\__,_|_| |_|
                    __/ |                      
                   |___/                       '''
stages = ['''
  +---+
  |   |
  O   |
 /|\  |
 / \  |
      |
=========''', '''
  +---+
  |   |
  O   |
 /|\  |
 /    |
      |
=========''', '''
  +---+
  |   |
  O   |
 /|\  |
      |
      |
=========''', '''
  +---+
  |   |
  O   |
 /|   |
      |
      |
=========''', '''
  +---+
  |   |
  O   |
  |   |
      |
      |
=========''', '''
  +---+
  |   |
  O   |
      |
      |
      |
=========''', '''
  +---+
  |   |
      |
      |
      |
      |
=========''']  # створюю масив з зображеннями вісилиці на різних етапах
wordlist = open(
    'hangman_words').readlines()  # створюю масив з словами які можуть попастись які беру з файла hangman_words
word = wordlist[random.randint(0, len(wordlist) - 1)]  # визначаю слово яке попалось
looks_word = []  # створюю пустий масив для того щоб потім заповнювати його пропусками і буквами
guess = []  # створюю пустий масив для того щоб потім заповнювати його відповідями гравця
lives = 6  # записую кількусть життів гравця
print(logo)  # виводжу логотип
for i in word:  # заповнюю масив пропусками
    looks_word.append("_")
print(looks_word)  # вивожу масив з пропусками
while lives != 0 and looks_word.count("_") != 0:  # повторюю поки гравець не виграє чи програє
    gues = input("Gues a letter: ").lower()  # запитую гравця букву
    if guess.count(gues) > 0:  # провіряю чи цю літеру уже вводили якщо так то вивожу це
        print("You know this letter")
    else:
        guess.append(gues)  # добавляю відповідь гравця до масиву з  відповідями
        print(f"You guess {guess}")  # вивожу масив з відповідями гравця
        for i in range(len(word)):  # повторрюю довжину слова раз і записуюю в змінну і номер повторення
            if gues == word[i]:  # провіряю чи гравець вгадав букву і заміняю пропуск на неї якщо так
                looks_word[i] = word[i]
        if word.count(gues) == 0:  # провіряю чи гравець помилився якщо так забираю одне життя
            lives -= 1
            print("The letter is not in the word")
        print(stages[lives])  # вивожу вісилицю
        print(looks_word)  # вивожу слово з пропусками
if looks_word.count("_") == 0:  # провіряю гравець виграв чи програв вивожу це йому
    print("You win!")
else:
    print(word)
    print("you lose!")
